In [3]:
import numpy as np
from IPython.display import display
import pandas as pd

In [5]:
np.random.seed(100)
my_data = np.random.randint(0, 101, (4, 3))
my_data

array([[ 8, 24, 67],
       [87, 79, 48],
       [10, 94, 52],
       [98, 53, 66]], dtype=int32)

In [7]:
df = pd.DataFrame(my_data)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

    0   1   2
0   8  24  67
1  87  79  48
2  10  94  52
3  98  53  66

In [47]:
my_row_index = ['CA', 'NY', 'AZ', 'TX']  # 4 rows
my_col_index = ['Jan', 'Feb', 'Mar']  # 3 columns
full_index = pd.DataFrame(my_data, index=my_row_index, columns=my_col_index)
full_index = pd.DataFrame(my_data, index= ['CA', 'NY', 'AZ', 'TX'], columns=['Jan', 'Feb', 'Mar'])
display(full_index)
# get specific row
display(full_index.loc['NY'])  # Series
print()
display(full_index.iloc[2])  # Series
print("Rows:", full_index.index.tolist())  # שמות השורות
print("Columns:", full_index.columns.tolist())  # שמות העמודות
pd.concat([df, pd.DataFrame(data={'Jan':[9], 'Feb':[9], 'Mar':[9]})], ignore_index=False)
full_index = pd.concat([full_index, pd.DataFrame(data=[['9', '9', '9']], columns=full_index.columns)], ignore_index=False)

    Jan  Feb  Mar
CA    8   24   67
NY   87   79   48
AZ   10   94   52
TX   98   53   66

Jan    87
Feb    79
Mar    48
Name: NY, dtype: int32

Jan    10
Feb    94
Mar    52
Name: AZ, dtype: int32

Rows: ['CA', 'NY', 'AZ', 'TX']
Columns: ['Jan', 'Feb', 'Mar']

   Jan Feb Mar
CA   8  24  67
NY  87  79  48
AZ  10  94  52
TX  98  53  66
0    9   9   9